## <center>Elements Of Data Science - F2022</center>
# <center>Week 13: Data Processing, Databases and SQL<center>
### <center>12/7/2022</center>

# TODOs

- Quiz 13, **Due Tuesday December 13th, 11:59pm ET**

- Final
  - Online via Gradescope, open-book, open-note, open-python
  - Released *Wednesday December 7th 11:59pm ET*
  - **Due Friday December 9th 11:59pm ET**
  - Have maximum of 24hrs after starting to finish
  - 30-40 questions (fill in the blank/multiple choice/short answer)
  - Questions asked/answered **privately** via Ed

# Today

- Data processing with Pandas
- Relational DBs and SQL
- Connecting to databases with sqlalchemy and pandas

<br>
<br>

# <center>Questions?</center>
<br>
<br>

# Environment Setup

In [1]:
import numpy
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from mlxtend.plotting import plot_decision_regions

sns.set_style('darkgrid')
%matplotlib inline

# Data Processing and Delivery: ETL

- **E**xtract **T**ransform **L**oad
<br>

- Extract: Reading in data
- Transform: Transforming data
- Load: Delivering data

# Extract: Various Data Sources

- flatfiles (csv, excel)
- semi-structured documents (json, html)
- unstructured documents
- data + schema (dataframe,database, parquet)
- APIs (wikipedia, twitter, spotify, etc.)
- databases
<br>
<br>

- Pandas to the rescue!
+ Plus other specialized libraries

# Extracting Data with Pandas

- read_csv
- read_excel
- read_parquet
<br>

- read_json
- read_html
<br>

- read_sql
- read_clipboard
- ...

# Extract Data: CSV

Comma Separated Values

In [2]:
%cat ../data/example.csv

Year,Make,Model,Description,Price
1997,Ford,E350,"ac, abs, moon",3000.00
1999,Chevy,"Venture Extended Edition","",4900.00
1999,Chevy,"Venture Extended Edition, Very Large",,5000.00
1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799.00

In [3]:
df = pd.read_csv('../data/example.csv',header=0,sep=',')
df.head()

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,Venture Extended Edition,NaN,4900.0
2,1999,Chevy,"Venture Extended Edition, Very Large",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799.0

# Extract Data: Excel
<br>

<div align="center"><img src="images/excel_example.png"></div>

In [4]:
pd.read_excel('../data/example.xls')

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000
1,1999,Chevy,Venture Extended Edition,NaN,4900
2,1999,Chevy,"Venture Extended Edition, Very Large",NaN,5000
3,1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799

# Extract Data: Parquet

- open source column-oriented data storage
- part of the Apache Hadoop ecosystem
- often used when working with Spark
- requires additional parsing engine eg `pyarrow`
- includes both data and **schema**
- **Schema** : metadata about the dataset (column names, datatypes, etc.)

In [5]:
pd.read_parquet('../data/example.parquet')

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,Venture Extended Edition,None,4900.0
2,1999,Chevy,"Venture Extended Edition, Very Large",None,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799.0

# Extract Data: JSON

- **J**ava**S**cript **O**bject **N**otation
- often seen as return from api call
- looks like a dictionary or list of dictionaries
- pretty print using json.loads(json_string)

```
{
  "firstName": "John",
  "lastName": "Smith",
  "isAlive": true,
  "age": 27,
  "phoneNumbers": [
    {
      "type": "home",
      "number": "212 555-1234"
    },
    {
      "type": "office",
      "number": "646 555-4567"
    },
  ],
  "children": [],
  "spouse": null
}
```

# Extract Data: JSON

In [6]:
json_example = """
{"0": {"Year": 1997,
  "Make": "Ford",
  "Model": "E350",
  "Description": "ac, abs, moon",
  "Price": 3000.0},
 "1": {"Year": 1999,
  "Make": "Chevy",
  "Model": "Venture Extended Edition",
  "Description": null,
  "Price": 4900.0},
 "2": {"Year": 1999,
  "Make": "Chevy",
  "Model": "Venture Extended Edition, Very Large",
  "Description": null,
  "Price": 5000.0},
 "3": {"Year": 1996,
  "Make": "Jeep",
  "Model": "Grand Cherokee",
  "Description": "MUST SELL! air, moon roof, loaded",
  "Price": 4799.0}}
"""

In [7]:
pd.read_json(json_example,orient='index')

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000
1,1999,Chevy,Venture Extended Edition,None,4900
2,1999,Chevy,"Venture Extended Edition, Very Large",None,5000
3,1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799

# Extract Data: HTML

- **H**yper**T**ext **M**arkup **L**anguage
- Parse with BeautifulSoup

In [8]:
html = """
<html>
    <head>
        <title>Example</title>
    </head>
    <body>
        <p id="first" class="example"><strong>Example text!</strong></p>
        <p id="second" class="example">And More!</p>
    </body>
</html>
"""

from bs4 import BeautifulSoup

soup = BeautifulSoup(html)
[p.text for p in soup('p')]

['Example text!', 'And More!']

# Extract Data: APIs
    
- **A**pplication **P**rogramming **I**nterface
- defines interactions between software components and resourses
- most datasources have an API
- some require authentication
- python libraries exist for most common APIs
<br>
<br>

- **requests**: library for making web requests and accessing the results

# API Example: Wikipedia

In [9]:
import requests
url = 'http://en.wikipedia.org/w/api.php?action=query&prop=info&format=json&titles='
title = 'Data Science'
title = title.replace(' ','%20')
print(url+title)

http://en.wikipedia.org/w/api.php?action=query&prop=info&format=json&titles=Data%20Science

In [10]:
resp = requests.get(url+title)
resp.json()

{'batchcomplete': '',
 'query': {'pages': {'49495124': {'pageid': 49495124,
    'ns': 0,
    'title': 'Data Science',
    'contentmodel': 'wikitext',
    'pagelanguage': 'en',
    'pagelanguagehtmlcode': 'en',
    'pagelanguagedir': 'ltr',
    'touched': '2022-11-07T18:39:30Z',
    'lastrevid': 706007296,
    'length': 26,
    'redirect': '',
    'new': ''}}}}

In [11]:
resp.text

'{"batchcomplete":"","query":{"pages":{"49495124":{"pageid":49495124,"ns":0,"title":"Data Science","contentmodel":"wikitext","pagelanguage":"en","pagelanguagehtmlcode":"en","pagelanguagedir":"ltr","touched":"2022-11-07T18:39:30Z","lastrevid":706007296,"length":26,"redirect":"","new":""}}}}'

# API Example: Twitter

1. [Apply for Twitter developer account](https://projects.raspberrypi.org/en/projects/getting-started-with-the-twitter-api/2)
2. [Create a Twitter application to generate tokens and secrets](https://projects.raspberrypi.org/en/projects/getting-started-with-the-twitter-api/3)

In [12]:
with open('/home/bgibson/proj/twitter/twitter_consumer_key.txt') as f:
    consumer_key = f.read().strip()
with open('/home/bgibson/proj/twitter/twitter_consumer_secret.txt') as f:
    consumer_secret = f.read().strip()
with open('/home/bgibson/proj/twitter/twitter_access_token.txt') as f:
    access_token = f.read().strip()
with open('/home/bgibson/proj/twitter/twitter_access_token_secret.txt') as f:
    access_token_secret = f.read().strip()
 
from twython import Twython
twitter = Twython(consumer_key,consumer_secret,access_token,access_token_secret)

In [13]:
public_tweets = twitter.search(q='data science institute')['statuses']
for status in public_tweets[:3]:
    print('-------')
    print(status["text"])

-------
RT @jwoodgett: New position in data science and health research. Come join us at the Lunenfeld-Tanenbaum Research Institute @SinaiHealth, T…
-------
Are you Business owner and want to advetise your busienss like this then google this keyword - khojinINDIA and regi… https://t.co/wmNhogkfVC
-------
Come join our team at the Lunenfeld-Tanenbaum Research Institute as a Principal Investigator in Data Science and He… https://t.co/ZfbKm0wMr1

# API Example: Twitter

In [14]:
public_tweets[0]

{'created_at': 'Wed Dec 07 17:24:21 +0000 2022',
 'id': 1600541735519764482,
 'id_str': '1600541735519764482',
 'text': 'RT @jwoodgett: New position in data science and health research. Come join us at the Lunenfeld-Tanenbaum Research Institute @SinaiHealth, T…',
 'truncated': False,
 'entities': {'hashtags': [],
  'symbols': [],
  'user_mentions': [{'screen_name': 'jwoodgett',
    'name': 'Jim Woodgett',
    'id': 134941111,
    'id_str': '134941111',
    'indices': [3, 13]},
   {'screen_name': 'SinaiHealth',
    'name': 'Sinai Health',
    'id': 17158780,
    'id_str': '17158780',
    'indices': [124, 136]}],
  'urls': []},
 'metadata': {'iso_language_code': 'en', 'result_type': 'recent'},
 'source': '<a href="https://mobile.twitter.com" rel="nofollow">Twitter Web App</a>',
 'in_reply_to_status_id': None,
 'in_reply_to_status_id_str': None,
 'in_reply_to_user_id': None,
 'in_reply_to_user_id_str': None,
 'in_reply_to_screen_name': None,
 'user': {'id': 1427382006124535815,
  'id_str': '1427382006124535815',
  'name': 'UofT Data Sciences Institute (DSI)',
  'screen_name': 'UofTDSI',
  'location': 'Toronto, Ontario',
  'description': 'The Data Sciences Institute is a new multi-divisional, tri-campus, multidisciplinary hub for data science innovation @UofT.',
  'url': 'https://t.co/bDPAR8tjjK',
  'entities': {'url': {'urls': [{'url': 'https://t.co/bDPAR8tjjK',
      'expanded_url': 'https://datasciences.utoronto.ca/',
      'display_url': 'datasciences.utoronto.ca',
      'indices': [0, 23]}]},
   'description': {'urls': []}},
  'protected': False,
  'followers_count': 1336,
  'friends_count': 153,
  'listed_count': 12,
  'created_at': 'Mon Aug 16 21:29:57 +0000 2021',
  'favourites_count': 722,
  'utc_offset': None,
  'time_zone': None,
  'geo_enabled': False,
  'verified': False,
  'statuses_count': 736,
  'lang': None,
  'contributors_enabled': False,
  'is_translator': False,
  'is_translation_enabled': False,
  'profile_background_color': 'F5F8FA',
  'profile_background_image_url': None,
  'profile_background_image_url_https': None,
  'profile_background_tile': False,
  'profile_image_url': 'http://pbs.twimg.com/profile_images/1430177765077229573/1taXPa1r_normal.jpg',
  'profile_image_url_https': 'https://pbs.twimg.com/profile_images/1430177765077229573/1taXPa1r_normal.jpg',
  'profile_banner_url': 'https://pbs.twimg.com/profile_banners/1427382006124535815/1659456275',
  'profile_link_color': '1DA1F2',
  'profile_sidebar_border_color': 'C0DEED',
  'profile_sidebar_fill_color': 'DDEEF6',
  'profile_text_color': '333333',
  'profile_use_background_image': True,
  'has_extended_profile': True,
  'default_profile': True,
  'default_profile_image': False,
  'following': False,
  'follow_request_sent': False,
  'notifications': False,
  'translator_type': 'none',
  'withheld_in_countries': []},
 'geo': None,
 'coordinates': None,
 'place': None,
 'contributors': None,
 'retweeted_status': {'created_at': 'Mon Dec 05 21:47:48 +0000 2022',
  'id': 1599883262884732937,
  'id_str': '1599883262884732937',
  'text': 'New position in data science and health research. Come join us at the Lunenfeld-Tanenbaum Research Institute… https://t.co/92ijMrkaMu',
  'truncated': True,
  'entities': {'hashtags': [],
   'symbols': [],
   'user_mentions': [],
   'urls': [{'url': 'https://t.co/92ijMrkaMu',
     'expanded_url': 'https://twitter.com/i/web/status/1599883262884732937',
     'display_url': 'twitter.com/i/web/status/1…',
     'indices': [110, 133]}]},
  'metadata': {'iso_language_code': 'en', 'result_type': 'recent'},
  'source': '<a href="https://tapbots.com/software/tweetbot/mac" rel="nofollow">Tweetbot for Mac</a>',
  'in_reply_to_status_id': None,
  'in_reply_to_status_id_str': None,
  'in_reply_to_user_id': None,
  'in_reply_to_user_id_str': None,
  'in_reply_to_screen_name': None,
  'user': {'id': 134941111,
   'id_str': '134941111',
   'name': 'Jim Woodgett',
   'screen_name': 'jwoodgett',
   'location': 'Toronto',
   'description': 'Biomedical researcher at #LTRI: signaling, cancer & Alzheimers; @jwoodgett@mas.to He/Him #TerryFox https://t.co/c02NBnBblM',
   'url': 'https://t.co/JuNHii5lSG',
   'entities': {'url': {'urls': [{'url': 'https://t.co/JuNHii5lSG',
       'expanded_url': 'http://www.lunenfeld.ca/researchers/woodgett',
       'display_url': 'lunenfeld.ca/researchers/wo…',
       'indices': [0, 23]}]},
    'description': {'urls': [{'url': 'https://t.co/c02NBnBblM',
       'expanded_url': 'http://tfri.ca',
       'display_url': 'tfri.ca',
       'indices': [99, 122]}]}},
   'protected': False,
   'followers_count': 9882,
   'friends_count': 373,
   'listed_count': 205,
   'created_at': 'Mon Apr 19 22:25:15 +0000 2010',
   'favourites_count': 48679,
   'utc_offset': None,
   'time_zone': None,
   'geo_enabled': True,
   'verified': False,
   'statuses_count': 72497,
   'lang': None,
   'contributors_enabled': False,
   'is_translator': False,
   'is_translation_enabled': False,
   'profile_background_color': '709397',
   'profile_background_image_url': 'http://abs.twimg.com/images/themes/theme6/bg.gif',
   'profile_background_image_url_https': 'https://abs.twimg.com/images/themes/theme6/bg.gif',
   'profile_background_tile': False,
   'profile_image_url': 'http://pbs.twimg.com/profile_images/1590769232039612442/St7OcwMy_normal.jpg',
   'profile_image_url_https': 'https://pbs.twimg.com/profile_images/1590769232039612442/St7OcwMy_normal.jpg',
   'profile_banner_url': 'https://pbs.twimg.com/profile_banners/134941111/1629217146',
   'profile_link_color': '3A5738',
   'profile_sidebar_border_color': '86A4A6',
   'profile_sidebar_fill_color': 'A0C5C7',
   'profile_text_color': '333333',
   'profile_use_background_image': True,
   'has_extended_profile': True,
   'default_profile': False,
   'default_profile_image': False,
   'following': False,
   'follow_request_sent': False,
   'notifications': False,
   'translator_type': 'none',
   'withheld_in_countries': []},
  'geo': None,
  'coordinates': None,
  'place': None,
  'contributors': None,
  'is_quote_status': False,
  'retweet_count': 25,
  'favorite_count': 27,
  'favorited': False,
  'retweeted': False,
  'possibly_sensitive': False,
  'lang': 'en'},
 'is_quote_status': False,
 'retweet_count': 25,
 'favorite_count': 0,
 'favorited': False,
 'retweeted': False,
 'lang': 'en'}

# Loading Data with pandas

- to_csv
- to excel
- to_json
- to_html
- to_parquet
<br>

- to_sql
- to_clipboard
<br>

- to_pickle

# Data Processing Summary

- ETL
- reading datafiles using pandas
- website scraping (requests,BeautifulSoup)
- accessing data via API
- **Next:** accessing data via SQL

# Accessing Databases with Python

- databases vs flat-files
- Relational Databases and SQL
- NoSQL databases

# Flat Files

<div align="center"><img src="images/unnormalized.png"></div>

- eg: csv, json, etc
- Pros
  - Ease of access
  - Simple to transport
<br>

- Cons
  - May include redundant information
  - Slow to search
  - No integity checks

# Relational Databases

- Data stored in **tables** (rows/columns)
- Table columns have well defined datatype requirements
- Complex **indexes** can be set up over often used data/searches
- Row level security, separate from the operating system
- Related data is stored in separate tables, referenced by **keys**
<br>

- Many commonly used Relational Databases
  - sqlite (small footprint db, might already have it installed)
  - Mysql
  - PostgreSQL
  - Microsoft SQL Server
  - Oracle

# Database Normalization

- Organize data in accordance with **normal forms**
<br>

- Rules designed to:
  - reduce data redundancy
  - improve data integrity
<br>
<br>

- Rules like:
  - Has Primary Key
  - No repeating groups
  - Cells have single values
  - No partial dependencies on keys (use whole key)
  - ...

# Database Normalization
<br>

<div align="center"><img src="images/database_normalization.jpeg" width="1200px"></div>

From [https://www.minigranth.com/dbms-tutorial/database-normalization-dbms/](https://www.minigranth.com/dbms-tutorial/database-normalization-dbms/)

# De-Normalization
<br>

- But we want a single table/dataframe!
- Very often need to **denormalize**
- .. using joins! (like we've seen before)

# Structured Query Language (SQL)

- (Semi) standard language for querying, transforming and returning data
- Notable characteristics:
  - generally case independent
  - white-space is ignored
  - strings denoted with single quotes
  - comments start with double-dash "--"
  
```sql
SELECT 
    client_id
    ,lastname
FROM
    company_db.bi.clients --usually database.schema.table
WHERE
    lastname LIKE 'Gi%'   --only include rows with lastname starting with Gi
LIMIT 10
```

# Small but Powerful DB: SQLite3

- may already have it installed
- many programs use it to store configurations, history, etc
- good place to play around with sql

```
bgibson@civet:~$ sqlite3
SQLite version 3.22.0 2018-01-22 18:45:57
Enter ".help" for usage hints.
Connected to a transient in-memory database.
Use ".open FILENAME" to reopen on a persistent database.
sqlite> 
```

# Accessing Relational DBs: `sqlalchemy`

- flexible library for accessing a variety of sql dbs
- can use to query through pandas to retrieve a dataframe

import sqlalchemy

df = pd.read_csv('../data/example.csv',header=0,sep=',',na_values='None')
engine = sqlalchemy.create_engine('sqlite:///../data/autos.sqlite')
df.to_sql('sales',engine,if_exists='replace',index_label="ID")

import sqlalchemy

engine = sqlalchemy.create_engine('sqlite:///../data/example_business.sqlite')

data = [[102,'Mikel','Rouse',1002],
        [103,'Laura','Gibson',1003],
        [104,None,'Reeves',1003],
        [105,'Scott','Payseur',1004]]
clients = pd.DataFrame(data,columns=['client_id', 'firstname', 'lastname', 'home_address_id'])


addresses = pd.DataFrame([[1002,'1 First Ave.'],[1003,'2 Second Ave.'],[1005,'3 Third Ave.']],
                         columns=['address_id','address'])

engine = sqlalchemy.create_engine('sqlite:///../data/example_business.sqlite')
clients.to_sql('clients',engine,if_exists='replace',index=False)
addresses.to_sql('addresses',engine,if_exists='replace',index=False)

In [15]:
import sqlalchemy

# sqlite sqlalchemy relative path syntax: 'sqlite:///[path to database file]'
engine = sqlalchemy.create_engine('sqlite:///../data/example_business.sqlite')

# read all records from the table "clients"
sql = """
SELECT
    *
FROM
    clients
"""

pd.read_sql(sql,engine)

   client_id firstname lastname  home_address_id
0        102     Mikel    Rouse             1002
1        103     Laura   Gibson             1003
2        104      None   Reeves             1003
3        105     Scott  Payseur             1004

# SQL: SELECT

In [16]:
sql="""
SELECT 
    client_id
    ,lastname
FROM
    clients
"""

pd.read_sql(sql,engine)

   client_id lastname
0        102    Rouse
1        103   Gibson
2        104   Reeves
3        105  Payseur

# SQL: * (wildcard)

In [17]:
sql="""
SELECT 
    *
FROM
    clients
"""
clients = pd.read_sql(sql,engine)
clients

   client_id firstname lastname  home_address_id
0        102     Mikel    Rouse             1002
1        103     Laura   Gibson             1003
2        104      None   Reeves             1003
3        105     Scott  Payseur             1004

In [18]:
sql="""
SELECT 
    *
FROM
    addresses
"""
addresses = pd.read_sql(sql,engine)
addresses

   address_id        address
0        1002   1 First Ave.
1        1003  2 Second Ave.
2        1005   3 Third Ave.

# SQL: LIMIT

In [19]:
sql="""
SELECT 
    *
FROM
    clients
LIMIT 2
"""
pd.read_sql(sql,engine)

   client_id firstname lastname  home_address_id
0        102     Mikel    Rouse             1002
1        103     Laura   Gibson             1003

# SQL: WHERE

In [20]:
sql = """
SELECT
    *
FROM
    clients
WHERE home_address_id = 1003
"""

pd.read_sql(sql,engine)

   client_id firstname lastname  home_address_id
0        103     Laura   Gibson             1003
1        104      None   Reeves             1003

# SQL: LIKE and %

In [21]:
sql = """
SELECT
    *
FROM
    clients
WHERE (home_address_id = 1003) AND (lastname LIKE 'Gi%')
"""

pd.read_sql(sql,engine)

   client_id firstname lastname  home_address_id
0        103     Laura   Gibson             1003

# SQL: AS alias

In [22]:
sql="""
SELECT 
    client_id AS CID
    ,lastname AS Lastname
FROM
    clients AS ca
"""

pd.read_sql(sql,engine)

   CID Lastname
0  102    Rouse
1  103   Gibson
2  104   Reeves
3  105  Payseur

# SQL: (INNER) JOIN

In [23]:
sql="""
SELECT
    c.firstname
    ,a.address
FROM clients AS c
JOIN addresses AS a ON c.home_address_id = a.address_id
WHERE c.firstname IS NOT NULL
"""

pd.read_sql(sql,engine)

  firstname        address
0     Mikel   1 First Ave.
1     Laura  2 Second Ave.

# SQL: LEFT JOIN

In [24]:
sql="""
SELECT
    c.firstname,a.address
FROM clients AS c
LEFT JOIN addresses AS a ON c.home_address_id = a.address_id
WHERE c.firstname IS NOT NULL
"""

pd.read_sql(sql,engine)

  firstname        address
0     Mikel   1 First Ave.
1     Laura  2 Second Ave.
2     Scott           None

# SQL: RIGHT JOIN

In [25]:
sql="""
SELECT
    c.firstname,a.address
FROM clients AS c
RIGHT JOIN addresses AS a ON c.home_address_id = a.address_id
"""
pd.read_sql(sql,engine)

  firstname        address
0     Mikel   1 First Ave.
1     Laura  2 Second Ave.
2      None  2 Second Ave.
3      None   3 Third Ave.

# SQL: FULL OUTER JOIN

In [26]:
sql="""
SELECT
    c.firstname,a.address
FROM clients AS c
FULL OUTER JOIN addresses AS a ON c.home_address_id = a.address_id
"""
pd.read_sql(sql,engine)

  firstname        address
0     Mikel   1 First Ave.
1     Laura  2 Second Ave.
2      None  2 Second Ave.
3     Scott           None
4      None   3 Third Ave.

# SQL: Listing Tables

In [27]:
sql = """
SELECT 
    name
FROM sqlite_schema 
WHERE type='table' 
ORDER BY name
"""
pd.read_sql(sql,engine)

        name
0  addresses
1    clients

# SQL: And Much More!

- Multiple Joins
- DISTINCT
- COUNT
- ORDER BY
- GROUP BY
- Operators (string concatenate operator is '||' in sqlite)
- Subqueries
- HAVING
- see [Data Science From Scratch Ch. 23](https://ezproxy.cul.columbia.edu/login?qurl=https%3a%2f%2fsearch.ebscohost.com%2flogin.aspx%3fdirect%3dtrue%26db%3dnlebk%26AN%3d979529%26site%3dehost-live%26scope%3dsite%26ebv%3DEB%26ppid%3Dpp_275)

# pandasql

- allows for querying of pandas DataFrames using SQLite syntax
- good way to practice SQL without a database

In [28]:
from pandasql import PandaSQL 

# set up an instance of PandaSQL to pass SQL commands to
pysqldf = PandaSQL()

In [29]:
sql = """
SELECT
    c.firstname,a.address
FROM clients AS c
JOIN addresses AS a ON c.home_address_id = a.address_id
"""
pysqldf(sql)

  firstname        address
0     Mikel   1 First Ave.
1     Laura  2 Second Ave.
2      None  2 Second Ave.

# For More SQL practice

- [SQL Murder Mystery](https://mystery.knightlab.com/)
- [SQLZoo](https://sqlzoo.net/wiki/SQL_Tutorial)

# NoSQL

- Anything that isn't traditional SQL/RDBMS
  - key-value (Redis,Berkely DB)
  - document store (MongoDB, DocumentDB)
  - wide column (Cassandra, HBase, DynamoDB)
  - graph (Neo4j)
<br>
<br>

- Rapidly growing field to fit needs
- Probably more as we speak

# Example: Mongo
<br>

- records represented as documents (think json)
- very flexible structure
- great way to store semi-structure data
- a lot of processing needed to turn into feature vectors
<br>

- contains databases (db)
  - which contain collections (like tables)
    - which you then do finds on

# Example: Mongo

- Need to have Mongo running on your local machine with a 'twitter_db' database

import pymongo
import json
from pymongo import MongoClient, InsertOne

client = pymongo.MongoClient()
db = client.twitter_db
collection = db.twitter_collection
requesting = []

for jsonObj in public_tweets:
    #myDict = json.load(jsonObj)
    requesting.append(InsertOne(jsonObj))

result = collection.bulk_write(requesting)
client.close()

In [30]:
import pymongo

# start up our client, defaults to the local machine
client = pymongo.MongoClient() # host="mongodb://localhost:27017"

# get a connection to a database
db = client.twitter_db

# get a connection to a collection in that database
coll = db.twitter_collection

# Example: Mongo

In [31]:
# get one record
coll.find_one()

{'_id': ObjectId('638e40d4355fc7918bf682b1'),
 'created_at': 'Mon Dec 05 17:17:01 +0000 2022',
 'id': 1599815115872038912,
 'id_str': '1599815115872038912',
 'text': "RT @anifel20: You don't need to spend $𝟭𝟬𝟬𝟬𝘀 to learn Data Science.❌\n\nStanford University, Harvard University &amp; Massachusetts Institute of…",
 'truncated': False,
 'entities': {'hashtags': [],
  'symbols': [],
  'user_mentions': [{'screen_name': 'anifel20',
    'name': 'Felo Anifel',
    'id': 212922754,
    'id_str': '212922754',
    'indices': [3, 12]}],
  'urls': []},
 'metadata': {'iso_language_code': 'en', 'result_type': 'recent'},
 'source': '<a href="http://twitter.com/download/iphone" rel="nofollow">Twitter for iPhone</a>',
 'in_reply_to_status_id': None,
 'in_reply_to_status_id_str': None,
 'in_reply_to_user_id': None,
 'in_reply_to_user_id_str': None,
 'in_reply_to_screen_name': None,
 'user': {'id': 617864273,
  'id_str': '617864273',
  'name': 'Honourable-Saro',
  'screen_name': 'yomi_mabayoje',
  'location': 'outside my comfort zone. ',
  'description': '•Farmer •Travel Consultant. A Textrovert. CFC fan and a football lover',
  'url': None,
  'entities': {'description': {'urls': []}},
  'protected': False,
  'followers_count': 2663,
  'friends_count': 1390,
  'listed_count': 25,
  'created_at': 'Mon Jun 25 07:15:53 +0000 2012',
  'favourites_count': 165605,
  'utc_offset': None,
  'time_zone': None,
  'geo_enabled': True,
  'verified': False,
  'statuses_count': 262648,
  'lang': None,
  'contributors_enabled': False,
  'is_translator': False,
  'is_translation_enabled': False,
  'profile_background_color': '8B542B',
  'profile_background_image_url': 'http://abs.twimg.com/images/themes/theme8/bg.gif',
  'profile_background_image_url_https': 'https://abs.twimg.com/images/themes/theme8/bg.gif',
  'profile_background_tile': False,
  'profile_image_url': 'http://pbs.twimg.com/profile_images/1455294816531533826/Fupxb7Rs_normal.jpg',
  'profile_image_url_https': 'https://pbs.twimg.com/profile_images/1455294816531533826/Fupxb7Rs_normal.jpg',
  'profile_banner_url': 'https://pbs.twimg.com/profile_banners/617864273/1622337936',
  'profile_link_color': '1B95E0',
  'profile_sidebar_border_color': '000000',
  'profile_sidebar_fill_color': 'EADEAA',
  'profile_text_color': '333333',
  'profile_use_background_image': True,
  'has_extended_profile': True,
  'default_profile': False,
  'default_profile_image': False,
  'following': False,
  'follow_request_sent': False,
  'notifications': False,
  'translator_type': 'none',
  'withheld_in_countries': []},
 'geo': None,
 'coordinates': None,
 'place': None,
 'contributors': None,
 'retweeted_status': {'created_at': 'Tue Oct 25 17:44:08 +0000 2022',
  'id': 1584964039305703424,
  'id_str': '1584964039305703424',
  'text': "You don't need to spend $𝟭𝟬𝟬𝟬𝘀 to learn Data Science.❌\n\nStanford University, Harvard University &amp; Massachusetts Ins… https://t.co/7vi9rOvenc",
  'truncated': True,
  'entities': {'hashtags': [],
   'symbols': [],
   'user_mentions': [],
   'urls': [{'url': 'https://t.co/7vi9rOvenc',
     'expanded_url': 'https://twitter.com/i/web/status/1584964039305703424',
     'display_url': 'twitter.com/i/web/status/1…',
     'indices': [121, 144]}]},
  'metadata': {'iso_language_code': 'en', 'result_type': 'recent'},
  'source': '<a href="http://twitter.com/download/iphone" rel="nofollow">Twitter for iPhone</a>',
  'in_reply_to_status_id': None,
  'in_reply_to_status_id_str': None,
  'in_reply_to_user_id': None,
  'in_reply_to_user_id_str': None,
  'in_reply_to_screen_name': None,
  'user': {'id': 212922754,
   'id_str': '212922754',
   'name': 'Felo Anifel',
   'screen_name': 'anifel20',
   'location': 'Earth',
   'description': 'I tweet and retweet about Studying Abroad, Schools and Scholarships. STEM-Grad Assistantships tips.',
   'url': 'https://t.co/XKRqwas9Gs',
   'entities': {'url': {'urls': [{'url': 'https://t.co/XKRqwas9Gs',
       'expanded_url': 'https://www.youtube.com/channel/UCxtxU6JzeGiGK8Xw46LhqDg',
       'display_url': 'youtube.com/channel/UCxtxU…',
       'indices': [0, 23]}]},
    'description': {'urls': []}},
   'protected': False,
   'followers_count': 39704,
   'friends_count': 749,
   'listed_count': 217,
   'created_at': 'Sun Nov 07 13:07:50 +0000 2010',
   'favourites_count': 5692,
   'utc_offset': None,
   'time_zone': None,
   'geo_enabled': False,
   'verified': False,
   'statuses_count': 23584,
   'lang': None,
   'contributors_enabled': False,
   'is_translator': False,
   'is_translation_enabled': False,
   'profile_background_color': '000000',
   'profile_background_image_url': 'http://abs.twimg.com/images/themes/theme1/bg.png',
   'profile_background_image_url_https': 'https://abs.twimg.com/images/themes/theme1/bg.png',
   'profile_background_tile': False,
   'profile_image_url': 'http://pbs.twimg.com/profile_images/740321926086688768/y4-a8_pq_normal.jpg',
   'profile_image_url_https': 'https://pbs.twimg.com/profile_images/740321926086688768/y4-a8_pq_normal.jpg',
   'profile_link_color': '3B94D9',
   'profile_sidebar_border_color': '000000',
   'profile_sidebar_fill_color': '000000',
   'profile_text_color': '000000',
   'profile_use_background_image': False,
   'has_extended_profile': True,
   'default_profile': False,
   'default_profile_image': False,
   'following': False,
   'follow_request_sent': False,
   'notifications': False,
   'translator_type': 'none',
   'withheld_in_countries': []},
  'geo': None,
  'coordinates': None,
  'place': None,
  'contributors': None,
  'is_quote_status': False,
  'retweet_count': 4062,
  'favorite_count': 11196,
  'favorited': False,
  'retweeted': False,
  'lang': 'en'},
 'is_quote_status': False,
 'retweet_count': 4062,
 'favorite_count': 0,
 'favorited': False,
 'retweeted': False,
 'lang': 'en'}

# Example: Mongo Cont.

In [32]:
[x for x in coll.find(filter={'retweeted':False},projection={'user.screen_name'},limit=3)]

[{'_id': ObjectId('638e40d4355fc7918bf682b1'),
  'user': {'screen_name': 'yomi_mabayoje'}},
 {'_id': ObjectId('638e40d4355fc7918bf682b2'),
  'user': {'screen_name': 'Pepperdine_RGFR'}},
 {'_id': ObjectId('638e40d4355fc7918bf682b3'),
  'user': {'screen_name': 'milzmuzing'}}]

<br>
<br>

# <center>Questions re Databases?</center>
<br>
<br>

<br>
<br>

# <center>Question re Final?</center>
<br>
<br>